01_basic/1

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pub="http://www.schneider-electric.com/oreo/onedownload/publish">
   <soapenv:Header/>
   <soapenv:Body>
      <pub:CommunicatePublishChangeEvent>
         <!--Optional:-->
         <pub:publishEvent>
            <pub:sourceSystem>EDMS</pub:sourceSystem>
            <pub:action>AU</pub:action>
            <pub:timeStamp>2024-03-03T05:00:00+00:00</pub:timeStamp>
            <pub:publishedDocument>
<!--               <pub:Files>-->
<!--                  <pub:File>-->
<!--                     <pub:Name>DQ_SSO_BSL1_26022024_Name2201.pdf</pub:Name>-->
<!--                     <pub:NameOriginal>DQ_SSO_BSL1_26022024_NameOrigina2201.pdf</pub:NameOriginal>-->
<!--                     <pub:Size>434533</pub:Size>-->
<!--                     <pub:TypeID>4</pub:TypeID>-->
<!--                     <pub:Extension>.pdf</pub:Extension>-->
<!--                     <pub:Path>s3://use-s3-edms-sqe-ppr/EDMS-SQE/Document/H/composed/HA1/HA10485/HA10485_0.pdf</pub:Path>-->
<!--                  </pub:File>-->
<!--                  <pub:File>-->
<!--                     <pub:Name>DQ_SSO_BSL1_26022024_Name2121.pdf</pub:Name>-->
<!--                     <pub:NameOriginal>DQ_SSO_BSL1_26022024_NameOrigina2121.pdf</pub:NameOriginal>-->
<!--                     <pub:Size>434533</pub:Size>-->
<!--                     <pub:TypeID>4</pub:TypeID>-->
<!--                     <pub:Extension>.pdf</pub:Extension>-->
<!--                     <pub:Path>s3://use-s3-edms-sqe-ppr/EDMS-SQE/Document/H/composed/HA1/HA10485/HA10485_0.pdf</pub:Path>-->
<!--                  </pub:File>-->
<!--               </pub:Files>-->
               <!--Optional:-->
               <pub:Ranges>
                  <!--Zero or more repetitions:-->
                  <pub:Range>
                     <pub:RangeID>74776</pub:RangeID>
                  </pub:Range>
                  <pub:Range>
                     <pub:RangeID>74777</pub:RangeID>
                  </pub:Range>
                  <pub:Range>
                     <pub:RangeID>66146</pub:RangeID>
                  </pub:Range>
<!--                  <pub:Range>-->
<!--                     <pub:RangeID>8334816</pub:RangeID>-->
<!--                  </pub:Range>-->
               </pub:Ranges>
               <pub:LocalizedProperties>
                  <pub:LocalizedProperty>
                     <pub:LanguageName>en_GB</pub:LanguageName>
                     <pub:Title>English_Title</pub:Title>
                     <pub:Description>English_description</pub:Description>
                     <pub:Remarks>English_remarks</pub:Remarks>
                     <pub:LanguageID>859</pub:LanguageID>
                  </pub:LocalizedProperty>
<!--                  <pub:LocalizedProperty>-->
<!--                     <pub:LanguageName>fr_FR</pub:LanguageName>-->
<!--                     <pub:Title>French_Title</pub:Title>-->
<!--                     <pub:Description>French_description</pub:Description>-->
<!--                     <pub:Remarks>French_remarks</pub:Remarks>-->
<!--                     <pub:LanguageID>863</pub:LanguageID>-->
<!--                  </pub:LocalizedProperty>-->
                  <pub:LocalizedProperty>
                     <pub:LanguageName>es_ES</pub:LanguageName>
                     <pub:Title>Spanish_Title</pub:Title>
                     <pub:Description>Spanish_description</pub:Description>
                     <pub:Remarks>Spanish_remarks</pub:Remarks>
                     <pub:LanguageID>860</pub:LanguageID>
                  </pub:LocalizedProperty>
<!--                  <pub:LocalizedProperty>-->
<!--                     <pub:LanguageName>nl_BE</pub:LanguageName>-->
<!--                     <pub:Title>BE_Title</pub:Title>-->
<!--                     <pub:Description>BE_description</pub:Description>-->
<!--                     <pub:Remarks>BE_remarks</pub:Remarks>-->
<!--                     <pub:LanguageID>1360</pub:LanguageID>-->
<!--                  </pub:LocalizedProperty>-->
<!--                  <pub:LocalizedProperty>-->
<!--                     <pub:LanguageName>fr_BE</pub:LanguageName>-->
<!--                     <pub:Title>BE_Title</pub:Title>-->
<!--                     <pub:Description>BE_description</pub:Description>-->
<!--                     <pub:Remarks>BE_remarks</pub:Remarks>-->
<!--                     <pub:LanguageID>888</pub:LanguageID>-->
<!--                  </pub:LocalizedProperty>-->
<!--                  <pub:LocalizedProperty>-->
<!--                     <pub:LanguageName>**</pub:LanguageName>-->
<!--                     <pub:Title>silent_Title</pub:Title>-->
<!--                     <pub:Description>silent_description</pub:Description>-->
<!--                     <pub:Remarks>silent_remarks</pub:Remarks>-->
<!--                     <pub:LanguageID>852</pub:LanguageID>-->
<!--                  </pub:LocalizedProperty>-->
               </pub:LocalizedProperties>
               <pub:FileId>32062147</pub:FileId>
               <pub:GroupId>32062147</pub:GroupId>
               <pub:Title>DQ_SSO_title</pub:Title>
               <pub:Reference>DQ_SSO_doc01</pub:Reference>
               <pub:CommercialReferences>
                        <pub:CommercialReference>
                           <pub:CommercialReference>DQ_SSO_PRODUCT_08</pub:CommercialReference>
                           <pub:DefaultImage>true</pub:DefaultImage>
                           <pub:DocProductType>MAIN</pub:DocProductType>
                        </pub:CommercialReference>
<!--                        <pub:CommercialReference>-->
<!--                           <pub:CommercialReference>DQ_BSL-4555_SSS_PRODUCT_ID_5</pub:CommercialReference>-->
<!--                        </pub:CommercialReference>-->
                     </pub:CommercialReferences>
<!--                     <pub:LocalizedCommercialReferences>-->
<!--                  <pub:LocalizedCommercialReference>-->
<!--                     <pub:Locale>1555691</pub:Locale>-->
<!--                     <pub:LanguageEDMSId>863</pub:LanguageEDMSId>-->
<!--                     <pub:CommercialReferences>-->
<!--                        <pub:CommercialReference>-->
<!--                           <pub:CommercialReference>DQ_SSO_PRODUCT_08</pub:CommercialReference>-->
<!--                           <pub:DocProductType>MAIN</pub:DocProductType>-->
<!--                        </pub:CommercialReference>-->
<!--                     </pub:CommercialReferences>-->
<!--                  </pub:LocalizedCommercialReference>-->
<!--               </pub:LocalizedCommercialReferences>-->
               <pub:VersionNumber>1</pub:VersionNumber>
               <pub:Country>
                  <pub:CountryName>International</pub:CountryName>
                  <pub:CountryID></pub:CountryID>
               </pub:Country>
               <pub:Audience>
                  <pub:Audience>Public</pub:Audience>
                  <pub:AudienceID>74</pub:AudienceID>
               </pub:Audience>
               <pub:DocumentType>
                  <pub:DocumentType>Certificate</pub:DocumentType>
                  <pub:DocumentTypeID>26</pub:DocumentTypeID>
               </pub:DocumentType>
               <pub:AvailableOnlyForList>
                  <!--Zero or more repetitions:-->
                  <pub:GenericKeyValue>
                     <!--Optional:-->
                     <pub:Label>Corporate</pub:Label>
                     <pub:Id>0</pub:Id>
                  </pub:GenericKeyValue>
               </pub:AvailableOnlyForList>
               <pub:Programs>
                  <pub:GenericKeyValue>
                     <pub:Label>IT Power Premier</pub:Label>
                     <pub:Id>1013</pub:Id>
                  </pub:GenericKeyValue>
               </pub:Programs>
               <pub:ChannelList>
                  <pub:Channel>
                     <pub:Id>47705265060</pub:Id>
                  </pub:Channel>
                   <pub:Channel>
                     <pub:Id>47705265062</pub:Id>
                  </pub:Channel>
               </pub:ChannelList>
               
               
            </pub:publishedDocument>
         </pub:publishEvent>
      </pub:CommunicatePublishChangeEvent>
   </soapenv:Body>
</soapenv:Envelope>